export const enum StatusEnum {
    ////////////////////////////////////////////////
    //สถานะของงานตาม WORKFLOW ต้องปรับและใช้จากที่นี่เท่านั้น (ห้ามใส่เป็นหมายเลขใน code)
    //*****ต้องมีการปรับตัวเลขสถานะให้ตรงกับเลขใน Directus/Database เสมอ
    ////////////////////////////////////////////////
  
    //Request status สถานะการร้องขอ/สั่งการ
    //====================================
    EVENT_CREATE = 1,              //สร้างเหตุการณ์
    EVENT_WAIT_FOR_APPROVAL = 2,  //รออนุมัติ
    EVENT_APPROVAL = 3, //อนุมัติเผชิญเหตุ
    EVENT_WORK_FOR_EDIT = 4,   //ส่งกลับมาแก้ไข้
    EVENT_RESTORE = 5,          //ฟื้นฟู
    EVENT_COMPLETED = 6,           //เหตุยุติแล้ว
    //====================================
  }
  